# 판다스(panda) 심화

## 기본 데이터 프레임 정렬

In [12]:
import numpy as np
import pandas as pd
print("DataFrame: ")
data = {
        'col1':[2,1,9,8,7,4],
        'col2':['A','B','B',np.nan,'D','C'],
        'col3':[0,1,9,4,2,3]
} 
index = [1,3,2,5,0,4]
df = pd.DataFrame(data,index=index)
df

DataFrame:

   col1 col2  col3
1     2    A     0
3     1    B     1
2     9    B     9
5     8  NaN     4
0     7    D     2
4     4    C     3

In [18]:
# index(행)axis=0을 축으로
df=df.sort_index(axis=0)

# index(열)axis=1을 축으로 내림차순
df=df.sort_index(axis=1, ascending=False)
df

   col3 col2  col1
0     2    D     7
1     0    A     2
2     9    B     9
3     1    B     1
4     3    C     4
5     4  NaN     8

In [19]:
# sort_value
df.sort_values('col1',ascending=True)

   col3 col2  col1
3     1    B     1
1     0    A     2
4     3    C     4
0     2    D     7
5     4  NaN     8
2     9    B     9

In [47]:
sorted_df2=df.sort_values(['col2','col1'],ascending=[True,False])
sorted_df2

   col3 col2  col1
1     0    A     2
2     9    B     9
3     1    B     1
4     3    C     4
0     2    D     7
5     4  NaN     8

In [50]:
# 데이터 
import numpy as np
import pandas as pd
data ={
    'korean' : [50,60,70,30],
    'math' : [30, np.nan, 40,20]
}
index =['a','b','c','d']
df = pd.DataFrame(data,index=index)

print(df.index)
print(df.columns)

Index(['a', 'b', 'c', 'd'], dtype='object')
Index(['korean', 'math'], dtype='object')

In [ ]:
# count() 함수
print(df.count(axis=0)) #axis = 0 기본값(생략가능)
print(df.count(axis=1))

In [57]:
# max(), min(), sum(), mean()


print(df.max(axis=1))
print(df.min(axis=1))
print(df.sum())
print(df.mean(axis=1))
print(df.mean(axis=1,skipna=False))

a    50.0
b    60.0
c    70.0
d    30.0
dtype: float64
a    30.0
b    60.0
c    40.0
d    20.0
dtype: float64
korean    210.0
math       90.0
dtype: float64
a    40.0
b    60.0
c    55.0
d    25.0
dtype: float64
a    40.0
b     NaN
c    55.0
d    25.0
dtype: float64

In [60]:
# 결측값 대체 fillna
avg=(df['math']).mean
df['math']=df['math'].fillna(avg)
df

   korean                                               math
a      50                                               30.0
b      60  <bound method Series.mean of a    30.0\nb     ...
c      70                                               40.0
d      30                                               20.0

## 그룹으로 묶기 groupby()

In [78]:
import numpy as np
import pandas as pd

df = pd.DataFrame({
    'key':['A','B','C','A','B','C'],
    'data1':[1,2,3,1,2,3],
    'data2':[4,4,6,0,6,1],
    # 'data2':['안녕','a','b','하세요','pple','3'],
})
print("DataFrame:")
df

DataFrame:

  key  data1  data2
0   A      1      4
1   B      2      4
2   C      3      6
3   A      1      0
4   B      2      6
5   C      3      1

In [80]:
df.groupby('key').sum()

     data1  data2
key
A        2      4
B        4     10
C        6      7

In [83]:
df.groupby(['key','data1']).sum()

           data2
key data1
A   1          4
B   2         10
C   3          7

In [86]:
df.groupby('key').aggregate(['min','median','max'])

    data1            data2
      min median max   min median max
key
A       1    1.0   1     0    2.0   4
B       2    2.0   2     4    5.0   6
C       3    3.0   3     1    3.5   6

In [87]:
df.groupby('key').aggregate({
    'data1':'max','data2':'sum'
})

     data1  data2
key
A        1      4
B        2     10
C        3      7